## Write a Pandas program to select rows by filtering on one or more column(s) in a multi-index dataframe.

In [1]:
import pandas as pd

In [2]:
def select_rows():
    df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 37, 33, 30, 31, 32],
    'tcode': ['t1', 't2', 't3', 't4', 't5', 't6']})
    
    df.set_index(['tcode', 'school_code'])
    
    return df.query(("tcode == 't1'") and ("school_code == 's001'"))

In [3]:
select_rows()

  school_code class            name date_of_birth  weight tcode
0        s001     V  Alberto Franco    15/05/2002      35    t1
3        s001    VI    Eesha Hinton    25/09/1998      30    t4